# BarModelDiameter Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BarTypeDiameterOptions..::..BarModelDiameter Property
BarTypeDiameterOptions Class See Also
---
Represents the bar model diameter of the RebarBarType.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public double BarModelDiameter { get; set; }
```

Visual Basic
---
```text
Public Property BarModelDiameter As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double BarModelDiameter {
	double get ();
	void set (double value);
}
```

# See Also
BarTypeDiameterOptions Class
Autodesk.Revit.DB Namespace